minor documentation changes
